[
    {
        "id": "ce07aae1-f982-408d-bdc6-be481a4b5737",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/ce07aae1-f982-408d-bdc6-be481a4b5737",
        "created_at": "Tue Mar 03 15:22:04 UTC 2020",
        "company": "TravelPerk",
        "company_url": "http://bit.ly/2IhWDkK",
        "location": "Barcelona",
        "title": "Software Engineers- All levels!",
        "description": "<p>We are TravelPerk: a fast-growing, well-funded startup that has raised nearly $134m since our creation in early 2015. Backed by world-class investors in some of tech’s most disruptive companies, including Slack, Trello, Twitter, Farfetch, Deliveroo and Delivery Hero, our team is made up of A-players from the travel industry.</p>\n<p>We’ve been named the fastest-growing SaaS startup in the world by the SaaS1000 and featured as one of the hottest startups to watch by both Forbes and Wired. We’re revolutionizing the B2B corporate travel market, worth over $1.3 trillion, by simplifying the process for everyone involved.</p>\n<p>TravelPerk is looking for Software Engineers of all levels- from Junior to Senior!</p>\n<p>Are you a Software Engineer with extensive programming experience? Is your code fast, efficient and reliable? Do you particularly enjoy working with amazing people, having fun at work and building something awesome? If so, let’s talk!</p>\n<p>We’re not looking for stack experts. We’re looking for smart people who can bring in the best tools and processes to get the job done.</p>\n<p>You will work on a day-to-day basis with our product team to design, architect and implement our product. TravelPerk is a next-generation platform to take the pain out of booking and managing business travel.</p>\n<p>As part of the Engineer team at TravelPerk you will...</p>\n<p>-Product development in Python/Django and React of a travel-related web-based product.\n-Integrations between our product to 3rd party APIs.\n-Architecture design, implementation, and testing.\n-Work in an Agile environment with strong attention to a well-documented code, unit testing, and continuous integration.</p>\n<p>We are looking for people with...</p>\n<p>-\"Product Engineering\" mindset.\n-Pragmatism and obsession for simplicity, efficiency, and performance.\n-Relevant experience in similar roles building technically complex products in any web programming language.\n-Experience at server-side, client-side or full stack development. Your final role within the team will depend on your skills and internal training will be provided.\n-Obsession for quality and testing.\n-Eager to learn new technologies and frameworks.\n-Strong communication skills (in English).</p>\n<p>Bonus points if you have any of the below...</p>\n<p>-Experience in the travel industry.\n-DevOps experience with the AWS suite.\n-Experience working with high-performing, Agile development teams.\n-Experience writing highly efficient asynchronous code.\n-People who like to build stuff (we really like people who maintain/contribute to open source projects).</p>\n<p>What do we offer?</p>\n<p>-Competitive compensation including equity in the company.\n-24 vacation days per year and flexible working hours.\n-Health perks: Choose between a private health scheme or a gym allowance.\n-\"Flexible compensation plan\" to help you diversify and increase the net salary.\n-Free Spanish classes.\n-Yoga and meditation.\n-Free coffee and beverages, fresh fruit and other breakfast stuff.</p>\n<p>The software engineering positions requires full-time, in-house work in Barcelona, Spain.</p>\n<p>TravelPerk is an equal opportunity employer: All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, or age.</p>\n",
        "how_to_apply": "<p>Hello,</p>\n<p>Please apply here: <a href=\"http://bit.ly/2IhWDkK\">http://bit.ly/2IhWDkK</a></p>\n<p>We are not looking for stack experts, we are looking for smart engineers to join us here at TravelPerk and make an impact to our product!</p>\n<p>If you have questions we can be reached at: <a href=\"mailto:biridie.slater@travelperk.com\">biridie.slater@travelperk.com</a>.</p>\n<p>We look forward to hearing from you!</p>\n<p>TravelPerk</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaGFBIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7e851d71d9865c165a887a3d517ceed877675899/logo_square%20(1).jpg"
    },
    {
        "id": "f3a312d1-5f40-44ee-a147-896ba76576bb",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/f3a312d1-5f40-44ee-a147-896ba76576bb",
        "created_at": "Tue Mar 03 14:20:50 UTC 2020",
        "company": "Alasco GmbH",
        "company_url": null,
        "location": "München",
        "title": "Senior Python Engineer Munich (m/f/x)",
        "description": "<p>You want to create a software that will transform the construction industry whilst leading a team of talented Backend Developers? Your are eager to build a SaaS Tool that helps our users work more efficient?</p>\n<p>Apply now at <a href=\"https://alasco.breezy.hr/p/8e09865af233\">https://alasco.breezy.hr/p/8e09865af233</a> and join Alasco as Senior Python Engineer!</p>\n<p>Your responsibility:</p>\n<ul>\n<li>You advance Alasco's engineering team by supporting your team members personally and professionally.</li>\n<li>You maintain a highly effective way of building our software including the monitoring and logging of large systems.\n• You strive to deliver the best possible experience for our users by continuously shipping new features for our cloud platform.</li>\n<li>You learn about the customers needs and processes and strive to solve them as quickly as possible.</li>\n<li>You build features with an “you build it, you run it” mindset and are responsible for testing, deployment and monitoring of your code.</li>\n</ul>\n<p>Your Profile:</p>\n<ul>\n<li>You have a master’s degree (or equivalent) in Computer Science or similar.</li>\n<li>You have profound and proven knowledge (5+years) of Python and experience with one of the popular frameworks (e.g. Django, flask).</li>\n<li>You are experienced in building a web application in a complex B2B domain.</li>\n<li>You are familiar working in an agile environment.</li>\n<li>You have a deep knowledge of architecture patterns, DevOps and AWS</li>\n<li>Experienced leading a small team of engineers</li>\n<li>You are fluent in English. Nice-to-have: You speak German at level C1/C2.</li>\n</ul>\n<p>Our Profile</p>\n<p>We believe in DevOps, continuous integration and testing.\nAt Alasco we use technologies, which enable us to provide our users with tools to reach their goals and to deliver at a fast pace. Our Backend services run on Python, Django and Postgres in Docker containers. The Frontend layer is based on JavaScript and React, Bootstrap and Sass with Webpack. We leverage AWS services by running our containers in Elastic Beanstalk and benefit from RDS, CloudWatch etc. Our teams ship code with the mindset of “you build it, you run it”. We manage our code in GitHub and use tools like CircleCI and Codacy to maintain a high quality standard in our codebase.</p>\n",
        "how_to_apply": "<p>Visit alasco.de/en/ or contact <a href=\"mailto:jobs@alasco.de\">jobs@alasco.de</a> to learn more about Alasco.</p>\n<p>To apply, click <a href=\"https://alasco.breezy.hr/p/8e09865af233\">https://alasco.breezy.hr/p/8e09865af233</a>.</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaFdBIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--16f651585c6073608d5215cd272dbc2050f3ff0e/Logotype.png"
    },
    {
        "id": "ae631e5b-0598-4638-a789-d312c3c378c6",
        "type": "Part Time",
        "url": "https://jobs.github.com/positions/ae631e5b-0598-4638-a789-d312c3c378c6",
        "created_at": "Tue Feb 25 17:21:27 UTC 2020",
        "company": "Port.",
        "company_url": "http://runport.io",
        "location": "New York City (Tribeca)",
        "title": "Front End Developer",
        "description": "<p>Our mission is to democratize private capital markets through data. To do so, we are building a single platform where people go to make decisions about private companies (as in, any company that is NOT traded on a stock exchange). We value trust, insight, and beauty. And we would like your help in making Port. a reality.</p>\n<p>In this role, you would be expected to rapidly translate detailed UX designs into a dynamic, polished application (initially in a responsive web app, and potentially in other forms later).\nThe ideal candidate will have the following:</p>\n<ul>\n<li>Fluency in a front-end framework of your joice (we prefer Angular but are open-minded)</li>\n<li>Experience working with Django and DRF</li>\n<li>Track record of delivering polished results on a clear timeline</li>\n</ul>\n<p>Our main back-end language is Python, and we of course welcome applicants who are interested in that part of the stack.</p>\n<p>What else... ideally, you have both the ability and willingness to deliver a professional product while maintaining a gnawing suspicion that there is something deeply wrong with the status quo.</p>\n<p>If this feels familiar, please contact us to discuss. We promise that, at the very least, the conversation will not be boring.</p>\n",
        "how_to_apply": "<p>Email resume and a BRIEF (250 words or less) note about why you are interested to <a href=\"mailto:jobs@runport.io\">jobs@runport.io</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcFYvIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a0ff58ceaf13be08141946770870d35eb136e9f9/Picture1.png"
    },
    {
        "id": "cc10f91b-1ccf-406a-9228-0b357db7481f",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/cc10f91b-1ccf-406a-9228-0b357db7481f",
        "created_at": "Wed Feb 12 20:10:31 UTC 2020",
        "company": "PolicyStat RLDatix",
        "company_url": "https://rldatix.com/en-us/products/policy-management",
        "location": "Indianapolis, IN",
        "title": "Python + Django Software Engineer",
        "description": "<h1>Make An Impact On Healthcare</h1>\n<p><a href=\"https://rldatix.com/en-us/products/policy-management\">PolicyStat's</a> mission is to improve healthcare delivery through better processes. We help our clients make their policies and procedures easier to find, access, and manage. Hundreds of hospitals use our SaaS application to ensure that this critical information is correct, their staff can find it, and that it supports regulatory compliance.</p>\n<p><a href=\"https://hub.jhu.edu/2016/05/03/medical-errors-third-leading-cause-of-death/\">More than 250,000 Americans die each year as a result of medical error</a>. Many of these deaths could have been prevented with existing best practices for quality and patient safety. A hospital's best tool for standardizing and implementing these life-saving improvements are their written policies and procedures.</p>\n<h1>Python + Django Software Engineer</h1>\n<p><strong>ON-SITE</strong>: Indianapolis, IN or Toronto, Canada</p>\n<p><strong>REMOTE</strong>: Indiana, New Jersey, and other locations</p>\n<p>As a critical member of our small product team, you'll assume several roles including back-end and front-end development, on-call support, API design, architecture, operations and database engineering.</p>\n<h2>Technical Requirements</h2>\n<ul>\n<li>Demonstrated proficiency with Python and Django</li>\n<li>Demonstrated understanding of Linux, Git, JavaScript, CSS and HTML5</li>\n</ul>\n<h2>Cultural Requirements</h2>\n<ul>\n<li>Ability to work effectively and collaborate on a small team.</li>\n<li>Excellent communication skills and strong teamwork ethic.</li>\n<li>Passion and enthusiasm for creating amazing products and delivering unparalleled user experience.</li>\n<li>Strongly motivated by opportunities to positively impact the direction of the company and products.</li>\n</ul>\n<h2>Responsibilities</h2>\n<ul>\n<li>Serve in the weekly rotation for triage of escalated support questions and server alerts.</li>\n<li>Take initiative to address pain points that you and/or the team experience by working to improve the software, tools or processes of PolicyStat.</li>\n<li>Review code contributed by the team and get it ready for production.</li>\n<li>Design, develop, document, and write automated tests for new features.</li>\n<li>Proactively analyze, diagnose, and resolve software regressions.</li>\n<li>Write well designed, testable, efficient code.</li>\n</ul>\n<h2>Highly Desired Skills</h2>\n<ul>\n<li>Demonstrated proficiency with React, GraphQL, MySQL, IPSec, SAML.</li>\n<li>A GitHub profile with lots of code and experience contributing to open source projects.</li>\n</ul>\n<h2>Compensation and Benefits</h2>\n<ul>\n<li>Market-based salary from $80k to $110k+ USD</li>\n<li>Health (including telemedicine) with HSA, dental, vision, disability, and life insurance</li>\n<li>10 paid holidays</li>\n<li>PTO: 15 days each year to start; 20 days starting the calendar year of third anniversary</li>\n<li>Annual paid team trip to engineering conference (Djangocon, pycon, etc)</li>\n<li>(on-site) Weekly catered team lunches</li>\n</ul>\n<h1>About PolicyStat</h1>\n<ul>\n<li>Founded in 2006, <a href=\"https://www.prnewswire.com/news-releases/rldatix-to-acquire-icontracts-300848612.html\">acquired</a> by <a href=\"https://www.rldatix.com\">RLDatix</a> in 2019.</li>\n<li>Technology stack: Python 3.7, Django 2.2, AWS (RDS, EC2, S3), Ubuntu Linux, MySQL, GraphQL, React (work in progress)</li>\n<li>Toolkit: Git, Vagrant, VirtualBox, Trello, <a href=\"https://github.com/PolicyStat\">GitHub</a>, Jenkins, continuous delivery / daily deploys (1000 in 2019), fast iterations</li>\n<li>See our <a href=\"https://stackoverflow.com/jobs/companies/policystat\">Stack Overflow Company</a> page</li>\n</ul>\n<h1>Apply</h1>\n<h2>Interview Process</h2>\n<ul>\n<li>Application review.</li>\n<li>Complete a <a href=\"https://medium.com/policystat-product-development/why-all-jobs-interviews-should-include-doing-real-work-34b54d393939\">work sample</a> (&lt; 60 minutes) in Python.</li>\n<li>Phone or video conversation with the team lead (&lt; 30 minutes).</li>\n<li>Complete a work sample (&lt; 3 hours) in Python + Django.</li>\n<li>Culture conversation with team members (on-site, if possible, otherwise remote video conference).</li>\n</ul>\n<p><a href=\"https://github.com/PolicyStat/jobs/blob/master/interview_process.md\">See more details</a></p>\n<h2>Remote Locations</h2>\n<p>We can hire individuals for full time employment who reside in\nCalifornia, Texas, Massachusetts, South Carolina, Florida, Pennsylvania, Illinois, Idaho, Indiana, Kentucky, Michigan, Missouri, New Jersey, New Mexico, Washington or some parts of Canada.\n<strong>If you reside in some other location, we can only pay you through a company</strong>.\nIf you have not already created a company\n(one that is responsible for taxes and can legally receive payments),\nyou will either need to create one,\nor alternatively we can hire you through a service such as\n<a href=\"https://upwork.com\">Upwork</a>.</p>\n<p><a href=\"http://bit.ly/pstat-jobs-python-django-engineer-2020-apply-github\">Click here to apply (Google Form)</a></p>\n",
        "how_to_apply": "<p><a href=\"http://bit.ly/pstat-jobs-python-django-engineer-2020-apply-github\">http://bit.ly/pstat-jobs-python-django-engineer-2020-apply-github</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc1YrIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bf59a414f124093d99f8a1fee3e69e7170bfd7ca/PolicyStat_Print_Full-Color-iContracts-v2.png"
    },
    {
        "id": "e777c1df-4ec5-4a20-96a8-2555f916eeb0",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/e777c1df-4ec5-4a20-96a8-2555f916eeb0",
        "created_at": "Tue Feb 11 17:34:57 UTC 2020",
        "company": "Klewel, the webcasting company",
        "company_url": "http://www.klewel.com",
        "location": "Martigny, Switzerland",
        "title": "Full-Stack Web Developer",
        "description": "<p>Klewel is a company active in the world of webcasting, a multidisciplinary field at the confluence of multimedia, communication, web and events. Since 2007, our team has been committed to webcast presentations given at conferences and workshops. <strong>With 12 years of experience, our operational activities have taken us to more than 40 countries</strong>!</p>\n<p>Klewel has developed <strong>a specialized webcasting platform to highlight and index audiovisually captured presentations</strong> (conferences, keynotes, debates, training seminars, courses). Our philosophy? At the service of knowledge sharing and knowledge transfer.</p>\n<p>In order to continually improve our product, we are currently recruiting a <strong>Full-Stack Web Developer</strong>.</p>\n<p>We are looking for a person to lead the product development activities who has <strong>at least three years of experience in this role with a specialization in software architecture / back-end</strong>. You have a solid higher education in computer science (Master or Bachelor). You are curious about the latest trends and new technologies, you wish to join a company with a human scale. So the following may be your next job!</p>\n<p>You will participate in the evolution of the existing web portal and its maintenance. In order to scale up, you will shape our platform. Beyond the purely development aspects, you will also have to manage virtual machines and administer our instances on the AWS environment. <strong>You are particularly comfortable with virtualization of web services, cloud computing</strong> and you have participated in such projects as a developer / tester in the past.</p>\n<p>Does this speak to you?</p>\n<p>You have an analytical mind. You are attentive, organized and autonomous. You master the Python language or equivalent. <strong>You have experience with a web framework</strong> such as Django. You are comfortable with <strong>code management/versioning tools</strong> such as Git and you master <strong>asynchronous process management systems</strong> with tools like Celery.</p>\n<p>You appreciate having slots dedicated to self-training in order to keep abreast of new developments and continue to learn. We encourage participation in conferences specialized in web development. You like mountains. Do you recognize yourself? then <a href=\"https://podio.com/webforms/23997449/1740755\">apply</a> !!!</p>\n",
        "how_to_apply": "<p>Apply here: <a href=\"https://podio.com/webforms/23997449/1740755\">https://podio.com/webforms/23997449/1740755</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcHArIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--df114aab0279e605394373c05aca0891d25111bd/Klewel-noir.png"
    },
    {
        "id": "07b3ce1e-ecbd-11e8-9de2-0e34d5bd5011",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/07b3ce1e-ecbd-11e8-9de2-0e34d5bd5011",
        "created_at": "Tue Nov 20 12:09:59 UTC 2018",
        "company": "Mindhive",
        "company_url": "http://www.mindhive.org",
        "location": "Brisbane CBD Australia",
        "title": "Senior Front End and Backend Developers",
        "description": "<p><strong>MINDHIVE FRONTEND AND BACKEND DEVELOPER ROLES</strong></p>\n<p>An exciting opportunity exists to work at Mindhive [www.mindhive.org] - the world’s first crowdsourced consultancy. We're looking for an experienced backend developer as part of our core team to take on some of our most demanding challenges to build and create a platform that will improve productivity and in turn change the way Mindhive clients and contributors solve challenges. You will be working closely with the engineering lead and developers in an agile environment with a high degree of freedom.</p>\n<p><strong>Mindhive</strong></p>\n<p>Mindhive sets out to do things differently – we’re taking a unique approach to creating the future of problem solving. The Company's core product is Mindhive - a cloud-based platform where organisational users (who pay) bring challenges to be solved by a growing community of high-quality individual users (non-paying) with a broad range of professional backgrounds and experiences. The model enables organisational users to gather, share and evaluate ideas efficiently and effectively, and gain access to diverse approaches to solving difficult problems. The existing model requires curation and input by administrators and does not take full advantage of the rich data available.</p>\n<p>Since completing a successful capital raising in 2017, the Company has hired a world-class development team [and has partnered with a leading digital design company Joseph Mark] which has given it the capability to develop a more technically complex platform ecosystem-style product (‘Mindhive 2.0’). Mindhive 2.0 will be a revolutionary approach that is ambitious in scale but grounded in historical experience (from the current platform) and growing market appetite for crowdsourcing and artificial intelligence</p>\n<p><strong>SENIOR BACKEND DEVELOPER ROLE</strong></p>\n<p>As a backend developer, you will help design, implement, deploy &amp; support Mindhive’s platform which includes (and not limited to):</p>\n<p>Cloud services\nDatabase\nIntegrations (in-house &amp; third party)\nTests (unit &amp; integration)</p>\n<p><strong>What you’ll do</strong></p>\n<p>Primary responsibility: Implement services (backend API endpoints) for mobile first web apps\nAdditional key responsibilities include:</p>\n<p>Develop cloud-based API services\nDevelop in-house &amp; 3rdparty integration interfaces\nDevelop database models\nImplement automated tests\nDevelop CI/CD scripts\nDevelop performance and monitoring interfaces\nAnalyse business and technical requirements</p>\n<p><strong>What you’ll bring</strong></p>\n<p>Detailed understanding of cloud architecture(s)\nDetailed knowledge of Python &amp; Node.JS\nDetailed knowledge of Django\nDetailed knowledge of Docker\nExperience working with\nPostgres and NoSQL database(s)\nExperience with authentication protocols &amp; certificates\nBonus: detailed knowledge of machine learning &amp; AI</p>\n<p><strong>How do I level up?</strong></p>\n<p>Roles within reach for the employee - Development Team Lead</p>\n<p><strong>Bespoke Requirements / Additional Responsibilities</strong></p>\n<p>Develop and maintain software specifications and architecture documents\nProvide accurate work estimates\nEngage in regular check-ins and follow-up with other developers in the team\nFollow Mindhive’s product development process and methodology</p>\n<p><strong>SENIOR FRONTEND DEVELOPER ROLE OVERVIEW</strong></p>\n<p>As a frontend developer, you will help design, implement, deploy &amp; support Mindhive’s platform which includes (and not limited to):</p>\n<p>Web application\nMobile application\nIntegrations (in-house &amp; third party)\nTests (unit &amp; integration)</p>\n<p><strong>What you’ll do</strong></p>\n<p>Primary responsibility: Implement UX/UI for mobile first web and mobile apps</p>\n<p><strong>Additional key responsibilities include:</strong></p>\n<p>Utilise any and all relevant frameworks, libraries and techniques:</p>\n<p>JavaScript (Vue.js and React Native)\nHTML5, CSS3 and SCSS for design implementations\nLinux Command Line (for bonus points)\nDemonstrate use of modern development practices such as use of Object-Oriented Design, Web Services (REST), Version Control (utilizing Git), Build processes and packaging (Webpack, etc), Automated Testing and Responsive Website Development\nCut up and implement designs\nInform the product team of relevant possibilities and solutions\nDevelop integration with cloud-based API services (in-house &amp; third party)\nReview and inform database models are in alignment with frontend view models &amp; components\nImplement components unit tests and automated tests as required\nDevelop web/site/mobile app performance and monitoring interfaces\nAnalyse business and technical requirements\nMinimise bugs in released code</p>\n<p><strong>What you’ll bring</strong></p>\n<p>Experience with current industry design tools (e.g. Figma)</p>\n<p>Understanding, and preferably experience in, agile project methodology\nYou have experience with version control and project management systems\nCan work and communicate effectively within multidisciplinary teams\nKnowledge of Accessibility and Security Principles\nUndergraduate degree in IT or relevant programming experience\nImpeccable attention to detail\nInnovative thinking and problem solving\nCourteous, supportive and honest\nMotivated self-starter, with the ability to manage your own time and adhere to time and budget restrictions\nEnthusiasm for the work\nMindhive does and your important role in delivery\nCreative thinking &amp; abstract, technical problem solving\nProactivity\nCollaboration</p>\n<p><strong>How do I level up?</strong></p>\n<p>Roles within reach for the employee - Development Team Lead</p>\n<p><strong>Bespoke Requirements / Additional Responsibilities</strong></p>\n<p>Develop and maintain software specifications and architecture documents:\nProvide accurate work estimates\nEngage in regular check-ins and follow-up with other developers in the team\nFollow Mindhive’s product development process and methodology</p>\n",
        "how_to_apply": "<p>Email your resume to <a href=\"mailto:career@mindhive.it\">career@mindhive.it</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUpYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5a6c8dd1ece5763c8a6aeb215ff3189fd8ed3bd7/c540fe15-d18d-48bd-95de-cf0a85125293"
    },
    {
        "id": "c5901f00-ec36-11e8-8d10-e7913612ce87",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/c5901f00-ec36-11e8-8d10-e7913612ce87",
        "created_at": "Mon Nov 19 20:08:09 UTC 2018",
        "company": "Prezi",
        "company_url": "http://prezi.com",
        "location": "San Francisco ",
        "title": "Senior Full Stack Engineer ",
        "description": "<p>Prezi strives to enable people to share ideas with each other, using our extraordinary product in a provenly more engaging and more effective way by helping millions of people build and deliver moving stories.</p>\n<p>To help our business stay on mission, we are looking for a senior full stack engineer to join us working on projects around the awareness, consideration and acquisition stages of the user journey.. Some examples are content discovery, content virality, end-to-end signup and payment experience, all SEO, email infrastructure, high traffic, top of the funnel part of the website etc. All of that with a laser focus on iterative increments of customer value.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>\n<p>Make significant contributions to the business by working with a cross-functional team to provide expertise, ship high-quality work, and complex components.</p>\n</li>\n<li>\n<p>Work in an agile team and organization, continuously refine our own processes towards best team performance and most fun. Our Engineering Managers, Product Owners and Program Management Team are dedicated to supporting you with this.</p>\n</li>\n<li>\n<p>Work through a variety of technical challenges that will require creativity and close collaboration across internal functions (design, UX, sales, marketing, etc).</p>\n</li>\n<li>\n<p>Release early, release often, deploy to production from day one.</p>\n</li>\n<li>\n<p>Work with a toolchain across infrastructure, data, continuous integration, back end, front end and 3rd party integrations with new things to pick up on the way.</p>\n</li>\n<li>\n<p>Coordinate and own development projects from beginning to end. Plan, implement with your fellow engineers, release, measure, repeat.</p>\n</li>\n<li>\n<p>Contribute to building our dev tools and architecture to enable us to more quickly ship new features into production at scale. Dev teams dedicate 20% of their time to this, while we also rely on our Infrastructure Team to help with major, company-wide tooling and infrastructure support.</p>\n</li>\n<li>\n<p>Participate in hackathons and engineering days</p>\n</li>\n<li>\n<p>Learn from and share your knowledge with your team and colleagues on the go.</p>\n</li>\n</ul>\n<p><strong>Skills and traits we are looking for:</strong></p>\n<ul>\n<li>\n<p>A passion for delivering value to users</p>\n</li>\n<li>\n<p>Excellent communication skills, both verbal and written</p>\n</li>\n<li>\n<p>4+ years experience in developing web applications in production (e.g. backend using Django, Rails, Node frontend using Backbone, React, Bootstrap)</p>\n</li>\n<li>\n<p>A solid understanding of the full web technology stack (e.g. cloud infrastructure, HTTP, cookies, asset loading, caching, REST)</p>\n</li>\n<li>\n<p>Proficiency with servers, linux, cloud infrastructure, build systems, continuous integration</p>\n</li>\n<li>\n<p>A passion for clean, maintainable, well-tested code</p>\n</li>\n<li>\n<p>Experience working with applications at scale</p>\n</li>\n<li>\n<p>The ability to structure and build complex client side applications</p>\n</li>\n<li>\n<p>Knowledge of test automation of backend and frontend applications</p>\n</li>\n<li>\n<p>Extensive knowledge of responsive design, web standards and modern browsers</p>\n</li>\n<li>\n<p>Ability and willingness to learn fast and pick up new things easily</p>\n</li>\n</ul>\n<p><strong>Benefits:</strong></p>\n<ul>\n<li>\n<p>A work environment where people from all backgrounds can thrive and grow</p>\n</li>\n<li>\n<p>People who listen to your opinions and value them</p>\n</li>\n<li>\n<p>The opportunity to spend time working at our Budapest office</p>\n</li>\n<li>\n<p>The opportunity to go to tech conferences anywhere in the world</p>\n</li>\n<li>\n<p>Flexible working hours and untracked vacations</p>\n</li>\n<li>\n<p>Quality meals, snacks, drinks every day</p>\n</li>\n<li>\n<p>A fun office with community activities, outings, presentations, office bar, happy hours, ping-pong/pool/foosball, a bar and sports leagues.</p>\n</li>\n<li>\n<p>A centrally located office in downtown San Francisco</p>\n</li>\n<li>\n<p>401k plan</p>\n</li>\n<li>\n<p>Health, dental and vision insurance</p>\n</li>\n<li>\n<p>Commuter benefits</p>\n</li>\n</ul>\n",
        "how_to_apply": "<p><a href=\"https://grnh.se/d5687acb1\">https://grnh.se/d5687acb1</a></p>\n",
        "company_logo": null
    },
    {
        "id": "7d0d5cf0-ec1f-11e8-9834-c8e30f51c014",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/7d0d5cf0-ec1f-11e8-9834-c8e30f51c014",
        "created_at": "Mon Nov 19 17:21:35 UTC 2018",
        "company": "Simons Foundation",
        "company_url": null,
        "location": "New York, New York",
        "title": "Web Developer",
        "description": "<p>POSITION SUMMARY</p>\n<p>This role will support the maintenance of several websites hosting editorially independent online publications covering research in autism, data and life sciences, mathematics and physics, as well as sites providing information about the foundation's support of basic and applied research.</p>\n<p>ESSENTIAL FUNCTIONS/RESPONSIBILITIES</p>\n<ul>\n<li>Support back-end and front-end web development for a diverse collection of foundation-affiliated websites, many built on WordPress</li>\n<li>Work collaboratively and closely with editors, front-end designers, web producers and other developers</li>\n<li>Effectively manage priorities for multiple concurrent projects</li>\n<li>Communicate with stakeholders to gather requirements and ensure their needs are being met</li>\n<li>Adapt to changing requirements</li>\n<li>Perform any other duties or tasks as assigned or required</li>\n</ul>\n<p>MINIMUM QUALIFICATIONS</p>\n<p>Education</p>\n<ul>\n<li>A bachelor's degree is required</li>\n</ul>\n<p>Experience</p>\n<ul>\n<li>Proficient with WordPress, with 3+ years of experience developing custom WP sites</li>\n<li>Advanced expertise with PHP and MySQL</li>\n<li>Deep understanding of HTML and CSS</li>\n<li>Experience with JavaScript and jQuery</li>\n<li>Experience with React or similar JS libraries or frameworks</li>\n<li>Experience with responsive web development</li>\n<li>Excellent communication skills</li>\n<li>Proficient with version control tools, such as Git and SVN.</li>\n<li>Portfolio of work products that function well on multiple device types</li>\n</ul>\n<p>Desirable</p>\n<ul>\n<li>Background in User Experience and User Interface design</li>\n<li>Experience with Python and Django</li>\n<li>Experience with responsive web design, integration and usability testing</li>\n<li>Experience with high-volume websites and/ or journalistic websites</li>\n<li>Comfort with Adobe Creative Cloud</li>\n</ul>\n<p>THE SIMONS FOUNDATION'S DIVERSITY COMMITMENT</p>\n<p>Many of the greatest ideas and discoveries come from a diverse mix of minds, backgrounds and experiences, and we are committed to cultivating an inclusive work environment. The Simons Foundation provides equal opportunities to all employees and applicants for employment without regard to race, religion, color, age, sex, national origin, sexual orientation, gender identity, genetic disposition, neurodiversity, disability, veteran status, or any other protected category under federal, state and local law.</p>\n<p>Apply Here:   <a href=\"http://www.Click2apply.net/tnq3zqdz2zmwb8qt\">http://www.Click2apply.net/tnq3zqdz2zmwb8qt</a></p>\n<p>PI105651217</p>\n",
        "how_to_apply": "<p><a href=\"http://www.Click2apply.net/tnq3zqdz2zmwb8qt\">http://www.Click2apply.net/tnq3zqdz2zmwb8qt</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUJYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5cec1fa3eb8f8a921945829b6e04fc43744f727e/29ad9da4-09d2-432c-bd49-6ad83582c9e8"
    },
    {
        "id": "cd535970-ec11-11e8-89ae-2e904411ec0e",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/cd535970-ec11-11e8-89ae-2e904411ec0e",
        "created_at": "Mon Nov 19 15:44:44 UTC 2018",
        "company": "Aon Cyber Solutions",
        "company_url": "http://www.strozfriedberg.com/careers",
        "location": "NY or LA",
        "title": "Cybersecurity Firm Seeks Senior Developer",
        "description": "<p>Aon Cyber Solutions is looking for a Senior Developer in NY or LA. As part of an industry-leading team, you will help empower results for our clients by delivering innovative and effective solutions supporting Risk.</p>\n<p>APPLY HERE: <a href=\"https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\">https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job</a></p>\n<p>Position Overview\nJoin our expert software development team to create new customer-facing web applications. You will apply your expertise in web development and user interface design, working in concert with subject matter experts in digital forensics, incident response, cybersecurity, and threat intelligence. Your applications will convey deeply technical facts and analyses to a variety of consumers, from risk managers to subject matter experts to C-level executives.</p>\n<p>The responsibilities of this position include but are not limited to the following:</p>\n<ul>\n<li>Design and develop pioneering web applications that cross the boundaries of security assessment, digital forensics, incident response, malware analysis, cybersecurity, and cyberinsurance.</li>\n<li>Serve as a senior developer on multiple product teams.</li>\n<li>Create user interfaces, APIs, data visualizations, and reports that provide our clients with insight into complex narratives and data sets.</li>\n<li>Translate high-level requirements into working prototypes to generate user feedback and discussion.</li>\n<li>Adapt and apply cutting edge computer science to highly technical domains.</li>\n<li>Participate in code reviews, write test suites, profile components, and take ownership of our software, source code, tools, and processes.</li>\n<li>Mentor other developers.</li>\n<li>Contribute to a positive, collaborative culture for innovation.</li>\n</ul>\n<p>Requirements</p>\n<ul>\n<li>5+ years of software engineer experience.</li>\n<li>Proficiency in frontend technologies (React, Node.js, Webpack).     Experience working with relational and NoSQL databases.</li>\n<li>Strong knowledge of HTTP and REST web services implementation.</li>\n<li>Test driven development and unit testing frameworks.</li>\n<li>Modern DevOps experience.</li>\n<li>Standard software engineering tools (git, Jenkins, JIRA).</li>\n<li>The proven ability to see things as they should be, and to realize that vision.</li>\n<li>Comfort with agile development and remote team environments.</li>\n<li>Excellence in verbal and written communication.</li>\n</ul>\n<p>Desired Skills</p>\n<ul>\n<li>TypeScript</li>\n<li>Python 3 and web frameworks such as Django or Flask.</li>\n<li>SQL &amp; relational database modeling.</li>\n<li>Experience in deployment to AWS, especially serverless technologies.</li>\n<li>Strong knowledge of JWT and various web security models.</li>\n<li>D3.js, Vega, Bokeh, Leaflet, and other browser visualization libraries.   Experiment-driven design and iterative features-based development (A/B testing, etc.).</li>\n<li>ElasticSearch, Apache Kafka, AWS Kinesis, PostgreSQL, AWS Aurora.</li>\n<li>Java 8 and other JVM-based languages.</li>\n<li>Performance monitoring and optimization.</li>\n<li>Mobile development using Native or Cross-platform (Xamarin, Ionic, React Native).</li>\n</ul>\n<p>Education Required</p>\n<ul>\n<li>BS or BA in Computer Science, Mathematics, or Statistics, or equivalent experience.</li>\n</ul>\n",
        "how_to_apply": "<p>APPLY HERE: <a href=\"https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\">https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job</a></p>\n",
        "company_logo": null
    },
    {
        "id": "9999f1f0-e448-11e8-966e-602e38acf303",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/9999f1f0-e448-11e8-966e-602e38acf303",
        "created_at": "Fri Nov 09 21:36:14 UTC 2018",
        "company": "BlueVine",
        "company_url": "http://bluevine.com",
        "location": "Redwood City, Ca",
        "title": "Senior Python Developer",
        "description": "<p>At BlueVine, we’re transforming how businesses get access to working capital financing. Founded in 2013, our online lending platform has helped 10,000+ business owners simplify their cashflow management, boost growth, and take advantage of new opportunities. As a leading FinTech company, we’re backed by Menlo Ventures, LightSpeed Ventures, 83North, Silicon Valley Bank, Citi Ventures, Microsoft Ventures and Nationwide Insurance among other notable investors. Our clients love us, the market we’re going after is huge, and we’re just getting started.</p>\n<p>We’re looking for exceptional people to help deliver the next generation of business financing solutions. We are a group of fun, creative, and motivated people that like to tackle challenges head on. If you have a strong desire to be part of a small, agile team, in an exciting and growing space, you’ll find your next job at BlueVine.</p>\n<p>As a <strong>Senior Python Developer</strong> at BlueVine you will be an important part of leading our platform development, and be a key member of our tech team.</p>\n<p><strong>BENEFITS &amp; PERKS:</strong></p>\n<ul>\n<li>Receive over $1,000 annually for a wellness benefit of your choice</li>\n<li>Free commuter benefits - CalTrain passes for SF employees and a monthly parking allowance for SF/NJ employees</li>\n<li>Weekly catered lunches</li>\n<li>Unlimited snacks in fully stocked kitchens</li>\n<li>Generous PTO and holidays</li>\n<li>Excellent health coverage and life insurance benefits</li>\n<li>Generous, paid parental leave which covers up to 15 weeks</li>\n<li>Pet-friendly offices</li>\n</ul>\n<p><strong>WHAT YOU'LL DO:</strong></p>\n<ul>\n<li>Architect and build state-of-the-art web &amp; mobile application using a variety of languages and tools</li>\n<li>Build distributed backend application in the cloud</li>\n<li>Understand repeatable automated processes for building the application, test it, document it, and deploy it at scale</li>\n<li>A desire to work as part of a growing, fast-paced, and highly-flexible team</li>\n<li>Work closely with, and incorporate feedback from, product designers and other stakeholders in the company</li>\n<li>Be able to develop a project through its entire lifecycle</li>\n<li>Have strong attention to details, a strong sense of ownership, pride in the quality of one's work and the ability to meet deadlines</li>\n<li>Provide technical direction and guidance, as well as draft specifications, architect solutions, define timelines, advise on industry best practice and problems to be solved</li>\n</ul>\n<p><strong>WHAT WE LOOK FOR:</strong></p>\n<ul>\n<li>Knowledge of Python (4+ years)</li>\n<li>Knowledge of Django (2+ years)</li>\n<li>Experience with Celery, RESTful APIs and server-side APIs integration</li>\n<li>Knowledge of ORM, SQL and Data Modeling</li>\n<li>Experience with TDD and ability to write quality unit tests</li>\n<li>Experience with AWS, cloud deployments, devops and web security</li>\n<li>Knowledge of JavaScript, HTML5, CSS3</li>\n<li>Ability to quickly learn new technologies and adapt to a fast-paced development environment</li>\n</ul>\n<p>BlueVine’s mission is to help business owners succeed and thrive by making sure they have convenient access to capital for their everyday funding needs. We’ve helped thousands of businesses since we started in 2013, funding more than $1 billion in working capital through our pioneering online platform. Our invoice factoring product allows business to receive cash advances on their outstanding invoices, offering factoring lines of up to $5 million. Our business line of credit product, called Flex Credit, offers financing based on 6-month and 12-month payment terms, and credit lines of up to $250,000. Based in Redwood City, Calif., BlueVine is backed by leading venture capital firms.</p>\n",
        "how_to_apply": "<p>[Senior Python Developer] (<a href=\"https://jobs.lever.co/bluevine/17ae9fff-deb7-4f61-b2cb-4507840e24bf?lever-origin=applied&amp;lever-source%5B%5D=GitHub\">https://jobs.lever.co/bluevine/17ae9fff-deb7-4f61-b2cb-4507840e24bf?lever-origin=applied&amp;lever-source%5B%5D=GitHub</a>)</p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcVpXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8b6025c5a6fe7b1fcfa4d8ead233a6ef0e956a5a/98456b19-f8cb-4e7c-863d-6dafefc20196"
    },
    {
        "id": "dc428b94-e42e-11e8-91e2-23879ca9e8b0",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/dc428b94-e42e-11e8-91e2-23879ca9e8b0",
        "created_at": "Fri Nov 09 14:51:11 UTC 2018",
        "company": "New York University",
        "company_url": null,
        "location": "New York, New York 10001",
        "title": "Technology Solutions Developer",
        "description": "<p>As a member of the Technology Development Group, the Technology Solutions Developer is responsible for designing, implementing, and testing a wide variety of web applications, and supporting the School of Law's web presence, including academic and administrative functions. The responsibilities range from designing and developing end-to-end applications, planning and developing new site features, and extending existing applications to keeping web systems up-to-date, and integrating 3rd party applications with the school's application stack. The role requires excellent technical skills, analytical and creative problem solving skills, an ability to work independently or with a group, initiative, and high personal standards for quality work.</p>\n<p>US</p>\n<p>The Technology Development Group at NYU School of Law is a small, versatile, full stack development team. The vast majority of our development is in C#/.NET, with additional projects in PHP (Laravel) … both using Vue as our front-end framework.</p>\n<p>Our group develops and supports the school's website (Drupal), micro sites (usually WordPress), reporting, and administrative applications (both internal and public). We've been known to divert our energies towards improving our supporting infrastructure, and now run many of our services using Docker/Kubernetes/Terraform, and that only as part of our growing AWS presence. We're usually getting ourselves into trouble with interesting projects.</p>\n<p>YOU</p>\n<p>We're looking to add a developer who is flexible enough to code across different environments. Maybe you have experience in another language and are looking to switch it up. You're already good, but want to be better … and you want to learn new things and grow. Regardless, have an opinion, because we genuinely want to hear it!</p>\n<p>WHY</p>\n<p>As an employee of NYU Law, you would receive NYU's benefits (<a href=\"https://www.nyu.edu/employees/benefit.html\">https://www.nyu.edu/employees/benefit.html</a>), including excellent health coverage, retirement plans, and tuition remission. You would be part of a team of creative, talented technologists who continue to make NYU Law one of the top law schools in the country! Finally, you will be given the opportunity to become the professional you want to be, working with the tools you want to work with.</p>\n<p>Required Education:\nBachelor's degree.</p>\n<p>Required Experience:\n2-4 years' experience and expertise in working with high level languages such as: C#, PHP, Python, or Ruby; fluency in HTML, CSS, JavaScript; and familiarity with the general principles of system and network administration; direct experience with the all components of the LAMP stack and content management frameworks, such as Drupal and WordPress.</p>\n<p>Preferred Experience:\nExperience with a web development framework such as: .NET, Laravel, Django, or Rails. Experience with a JavaScript framework such as Vue, Angular, or React.</p>\n<p>Required Skills, Knowledge and Abilities:\nExcellent interpersonal and communication skills; ability and drive to learn new technologies and proactively look for ways to improve the School of Law's applications and web infrastructure.</p>\n<p>Preferred Skills, Knowledge and Abilities:\nKnowledge of module or plugin development for these frameworks is a plus. Fundamental knowledge of distributed version control systems and familiarity with one or more contemporary version control systems (e.g. Git/Mercurial/SVN)</p>\n<p>EOE/AA/Minorities/Females/Vet/Disabled/Sexual Orientation/Gender Identity</p>\n<p>Apply Here: <a href=\"http://www.Click2apply.net/cyg9sy9m99zdm9v2\">http://www.Click2apply.net/cyg9sy9m99zdm9v2</a></p>\n<p>PI105491972</p>\n",
        "how_to_apply": "<p>Apply Here: <a href=\"http://www.Click2apply.net/cyg9sy9m99zdm9v2\">http://www.Click2apply.net/cyg9sy9m99zdm9v2</a></p>\n",
        "company_logo": null
    },
    {
        "id": "e5f347ea-e277-11e8-989d-9bece5ee00a0",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/e5f347ea-e277-11e8-989d-9bece5ee00a0",
        "created_at": "Wed Nov 07 10:55:22 UTC 2018",
        "company": "Alasco GmbH",
        "company_url": "https://www.alasco.de/",
        "location": "Munich",
        "title": "Frontend Engineer (m/f)",
        "description": "<p>Alasco helps construction companies complete projects on time and budget. We digitalize the processes in construction planning and execution by offering a cloud based workflow platform. Alasco has been founded in 2018 by three well-known tech entrepreneurs in Munich (Anselm Bauer, Benjamin Günther, Sebastian Schuon) to enable more and higher quality buildings for everybody. If you are interested in participating in a startup early on, do join our cause!</p>\n<p>•Your Responsibilities: Together with your team, you ship new features for our cloud platform. You will participate in all SCRUM meetings and contribute to improve both the product and your team. After learning about the customers needs and processes you strive to solve them and to deliver the best possible experience for our users by empowering them through an effective and intuitive UI</p>\n<p>•Your Profile: You have mastered one frontend framework (preferably react) and have experience in collaborating with designers, bringing wireframes to life. You strive for re-usability. Styling elements is a no-go, let’s use classes and variables for that! Previously you have been part of an agile development team. Besides being fluent in English, we want to you to have a desire to learn and grow!</p>\n<p>•Our Profile\nWe are a small team of software engineers, partly distributed. For our work we use a python/django/postgres stack in the backend and use react/bootstrap in the frontend. All running on AWS. We believe in DevOps, Continuous Integration and Testing (and live it) and work as a SCRUM team, with open boards and retros. We strive hard to balance development speed and software quality and care about the personal growth of our team members!</p>\n",
        "how_to_apply": "<p>Submit your application through <a href=\"https://alasco.breezy.hr/p/49ca07b39fa3-frontend-engineer-m-w-d\">https://alasco.breezy.hr/p/49ca07b39fa3-frontend-engineer-m-w-d</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb05XIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--834caeaebed8c5a2c4f9fc769ba05f9a69539cd6/4317ab46-3da3-432d-b505-e73e17ad3eea"
    },
    {
        "id": "5dad93a8-e11f-11e8-9f88-578950b09034",
        "type": "Full Time",
        "url": "https://jobs.github.com/positions/5dad93a8-e11f-11e8-9f88-578950b09034",
        "created_at": "Mon Nov 05 17:27:42 UTC 2018",
        "company": "REPAY - Realtime Electronic Payments",
        "company_url": null,
        "location": "Phoenix, Atlanta, Remote-US Based",
        "title": "Full Stack Developer - Python",
        "description": "<p>REPAY – Realtime Electronic Payments is an established and fast growing, Financial Technology company. We build great software that enables businesses to move faster by removing friction in payments processing by offering a comprehensive line of electronic payment solutions including debit and credit card processing, ACH processing, instant funding, and electronic bill payment systems with full IVR, text, and mobile capabilities.</p>\n<p>REPAY is looking for an experienced Full Stack Developer (Python) to be part of our Agile and growing software development team in expanding our core payment processing platform and products within the consumer finance industry. Work in a small team, where you will have an immediate and measurable impact on our fast-growing business by helping us reach the next level and stage of growth. Here, we work hard—but we have lots of fun doing it. So, if you like a cool, collaborative, and challenging work environment, you’ll fit right in.</p>\n<p>THIS POSITION CAN BE REMOTE (US BASED) OR IN TEMPE, AZ OR ATLANTA, GA</p>\n<p>REPAY’s Tech Stack:</p>\n<p>Python 3.x\nPyramid\nReact\nReact Native\nAWS\nRedux\nRedshift\nDocker\nPostgres\nInteract with the TwilioAPI, SendGrid, and others</p>\n<p>You’ll be responsible for:</p>\n<ul>\n<li>Building and enhancing our core API, user interfaces, and backend processing systems via new greenfield development and supporting legacy systems</li>\n<li>Integrating with existing corporate and partner applications which span multiple languages and frameworks</li>\n<li>Developing high performance and reusable software with excellent test coverage</li>\n<li>Developing and deploying to cloud-based technology (AWS)</li>\n<li>Participate in the design of our core products</li>\n<li>Evaluating existing and new technologies and ensuring our applications utilize industry best practices</li>\n<li>Supporting the operations team in order to provide the best uptime and service quality</li>\n<li>Occasional travel to Tempe, AZ for remote employees</li>\n</ul>\n<p>Skills &amp; Requirements:</p>\n<ul>\n<li>Experience working with Python (3.x), Django and/or Pyramid</li>\n<li>Experience with building highly available systems</li>\n<li>Experience working with JavaScript</li>\n<li>A track record of success with developing modern APIs</li>\n<li>Good understanding of application security</li>\n</ul>\n<p>Preferred Skills &amp; Requirements:</p>\n<ul>\n<li>Experience working with ReactJS, React-Native</li>\n<li>Docker strongly preferred</li>\n<li>Good understanding of Payments processing and/or developing Payments products</li>\n<li>Familiarity of PCI compliance</li>\n</ul>\n<p>Why #REPAYrocks:</p>\n<ul>\n<li>Access to online learning platforms like PluralSight, Udemy, AskLynda.</li>\n<li>Encourage continuing education including professional conferences and events</li>\n<li>Flexible schedule/work from home</li>\n<li>Employee bonus program</li>\n<li>REPAY has been named by FORTUNE® magazine as one of the Top 50 “Best Small Workplaces in America” for 2017!  <a href=\"http://fortune.com/best-small-workplaces/repay-48/\">http://fortune.com/best-small-workplaces/repay-48/</a>\n</li>\n<li>REPAY was ranked again for the 8th straight year in a row #2164 on the Inc. 5000 List of America’s Fastest Growing Private Companies for 2018!</li>\n<li>REPAY has also been certified as a Great Places to Work company for 2017!\nWhy Join the REPAY Family?</li>\n<li>Growing ~ We are the industry-leading, financial-technology provider in the Consumer Finance space and continue to set the standard for application development and delivery.</li>\n<li>Awesome Work Environment ~ Business to casual dress, great snacks and beverages, open-air collaborative team setting.</li>\n<li>Great teaming and Work-Life-Balance ~ The team is fun, smart, and collaborative. We truly enjoy working together.  We are all self-driven, motivated professionals that do not require micro-management to make sure we honor our work and project commitments.</li>\n<li>Leadership Support ~ The founders and leadership team “get” and recognize both individual and team performance.</li>\n<li>Difficult Problems to Solve ~ We create highly sophisticated payment processing applications and are constantly pushing the boundaries of what is possible on the web, with mobile, SMS, and IVR applications in support of alternative payment channels. We are working on extensive new product and feature development.</li>\n<li>Innovation and Ideas ~ We constantly listen to clients and employees to find the best ideas, and we provide the resources necessary to ensure those priorities are implemented quickly.</li>\n</ul>\n<p>DIRECT APPLICANTS ONLY, NO C2C, MUST BE ELIGIBLE TO WORK FOR A US EMPLOYER</p>\n",
        "how_to_apply": "<p>Email your resume to <a href=\"mailto:jcohen@repay.com\">jcohen@repay.com</a></p>\n",
        "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbUJXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cb7bad5865d7efe72d42202ded74b3a9fe4b3c50/2852a53c-707a-48ff-af93-718314386315"
    }
]
